// 41. Выяснить являются ли три заданных отрезка сторонами треугольника 
//a, b, a - стороны треугольника, если выполняется условия a+b>a, b+a>a, a+a>b
// Console.WriteLine("Task41   ");
// void FillArray(int[] collection) // создание массива
// {
//     int length = collection.Length;
//     int index = 0;
//     while (index < length)
//     {
//         collection[index] = new Random().Next(50);
//         //index = index + 1;
//         index++;
//     }
// }

// void PrintArray(int[] col) // печать массива без переноса на новую строку
// {
//     int count = col.Length;
//     int position = 0;
//     while (position < count)
//     {
//         //Console.Write(col[position]);  - переносится на новую строку
//         Console.Write($"{col[position]} "); // без переноса на новую строку
//         position++;
//     }
//     Console.WriteLine();
// }

// int[] array = new int[3];

// FillArray(array);

// PrintArray(array);

// // являются ли три заданных отрезка сторонами треугольника?
// // int[] array = {2, 5, 16};

// if (((array[0] + array[1]) > array[2]) && ((array[1] + array[2]) > array[0]) && ((array[0] + array[2]) > array[1]))
// {
//     Console.WriteLine("Это треугольник");          
// }
// else
// {
//     Console.WriteLine("Это не треугольник");  
// }
// 42. Определить сколько чисел больше 0 введено с клавиатуры


// 43. Написать программу преобразования десятичного числа в двоичное


// 44. Найти точку пересечения двух прямых заданных уравнением y = k1 * x + b1, y = k2 * x + b2, b1 k1 и b2 и k2 заданы
// 45. Показать числа Фибоначчи
// 46. Написать программу масштабирования фигуры
// ```
// Тут для тех кто далеко улетел, чтобы задавались вершины фигуры списком (одной строкой)
// например: "(0,0) (2,0) (2,2) (0,2)"
// коэффициент масштабирования k задавался отдельно - 2 или 4 или 0.5
// В результате показать координаты, которые получатся.
// при k = 2 получаем "(0,0) (4,0) (4,4) (0,4)"
// ```
// 47. Написать программу копирования массива
